content/experience/_index.md
+++
title = "Professional Experience"
author = ["desktop"]
layout = "list"
lastmod = 2025-12-10T15:25:20-07:00
draft = false
summary = "A chronological history of bridging the gap between Sales Strategy and Operational Execution."
+++

****Welcome to the Operator's Log.****
Below is a timeline of my career. Click on any role to view the full "STAR" analysis, system architecture diagrams, and specific impact metrics.


## Retail Sales Associate {#t-mobile-retail-associate}


### Key Accomplishments {#key-accomplishments}


#### Workflow Automation (Low-Code Development) {#workflow-automation--low-code-development}

-   **Situation:** The standard process for generating quotes and following up with customers was manual and disorganized.
-   **Task:** To streamline the quoting and follow-up process to improve personal efficiency.
-   **Action:** Developed a custom tool using Google AppSheet to automate quote generation and track sales follow-ups.
-   **Result:** Improved personal organization and efficiency, demonstrating the ability to identify and solve process inefficiencies in any environment.


#### High-Volume Sales Execution {#high-volume-sales-execution}

-   **Situation:** The role required engaging with a high volume of customers in a fast-paced retail setting.
-   **Task:** To consult with customers on complex rate plans and secure upgrades.
-   **Action:** Engaged with 50+ customers daily, analyzing needs to demonstrate value on Go5G Plus and Go5G Next plans.
-   **Result:** Consistently met and exceeded sales targets for new customer acquisition and service add-ons.


## Commercial Loan Officer {#lendio-commercial-loan-officer}


### Key Accomplishments {#key-accomplishments}


#### Revenue Generation {#revenue-generation}

-   **Situation:** The company's business model depended on converting a high volume of inbound leads to meet aggressive monthly revenue targets.
-   **Task:** To manage the entire sales funnel from initial contact to close, consistently meeting or exceeding monthly revenue and unit goals.
-   **Action:** Executed a high-tempo sales strategy that involved conducting over 60 daily calls to engage qualified leads, guide clients through the application process, and negotiate terms.
-   **Result:** Consistently generated approximately $67,000 in revenue across an average of 25 units each month, maintaining a strong 35% offer-to-close rate.


#### Autonomous Performance {#autonomous-performance}

-   **Situation:** The role required a high degree of expertise in complex financial analysis and creative deal structuring.
-   **Task:** To perform all duties of the prior Traditional Lending SME role with full autonomy.
-   **Action:** Independently performed deep-dive cash flow analyses, structured creative financing solutions, and ensured compliance with SBA SOP 50 10.
-   **Result:** Demonstrated the ability to operate with full autonomy at a subject-matter expert level within a full-cycle sales role.


#### Strategic Funding Roadmaps {#strategic-funding-roadmaps}

-   **Situation:** Some clients did not qualify for premier loan products immediately but could with strategic financial planning.
-   **Task:** To create long-term funding roadmaps for clients to prepare them for future funding eligibility.
-   **Action:** Advised clients on how to structure their finances to qualify for progressively better funding solutions over time, using creative alternative financing as a bridge.
-   **Result:** Increased customer LTV and renewal rates by structuring creative financing solutions that prepared clients for future eligibility for premier loan products.


#### SBA Compliance {#sba-compliance}

-   **Situation:** SBA loan applications are often put on hold in the Etran system due to compliance issues like tax liens or CAIVRS errors.
-   **Task:** To collaborate with underwriters and external parties to resolve Etran hold codes and ensure compliance with SBA SOP 50 10.
-   **Action:** Collaborated with internal underwriters to resolve Etran hold codes and worked with external parties to gather necessary documentation.
-   **Result:** Successfully resolved an average of 3-4 Etran hold codes per month, saving deals that would have otherwise been lost.


#### Referral Network Development {#referral-network-development}

-   **Situation:** To supplement the pipeline of company-provided leads, it was beneficial to generate personal leads through a professional network.
-   **Task:** To develop a referral network to generate a consistent pipeline of new leads.
-   **Action:** Actively networked and developed a referral network of vendors, CPAs, and business coaches.
-   **Result:** Generated a consistent pipeline of new leads in addition to the company-provided inbound leads.


#### Financial Analysis {#financial-analysis}

-   **Situation:** Clients needed to understand the financial implications and potential return on investment for various complex financing options.
-   **Task:** To conduct detailed ROI and financial analyses to help clients make informed decisions.
-   **Action:** Conducted detailed ROI analyses comparing various strategic financing options and performed in-depth financial analysis (Cash Flow, DSCR) on tax returns.
-   **Result:** Empowered clients to make informed financial decisions and identified the optimal funding solutions for their specific needs.


#### SBA Loan Packaging and Closing {#sba-loan-packaging-and-closing}

-   **Situation:** Closing SBA loans requires specialized knowledge of SBA SOPs and the ability to prepare bank-compliant loan packages.
-   **Task:** To prepare and package bank-compliant loan documents to successfully close SBA 7(a) and Express loans.
-   **Action:** Prepared and packaged all necessary documents for SBA 7(a) and Express loans, ensuring compliance with bank and SBA requirements.
-   **Result:** Closed an average of 7 SBA 7(a) and Express loans per month, demonstrating expertise in SBA loan packaging and closing.


#### High-Volume Loan Origination {#high-volume-loan-origination}

-   **Situation:** The primary goal of the role was to generate significant loan volume for the company.
-   **Task:** To apply a consultative sales approach to a pipeline of inbound leads to originate a high volume of loans.
-   **Action:** Applied a highly consultative sales approach to diagnose business needs and match clients with the best financing solutions from a network of over 75 lenders.
-   **Result:** Successfully originated over $5MM in total loan volume during my tenure in the role.


#### Full-Cycle Sales Management {#full-cycle-sales-management}

-   **Situation:** The role required managing a high-volume, full-cycle sales process for inbound leads.
-   **Task:** To manage the process from initial contact through negotiation and closing.
-   **Action:** Managed a pipeline following an SDR hand-off, initiating the process with an in-depth "Merchant Interview" and executing a multi-step negotiation process.
-   **Result:** Achieved an average 35% offer-to-close rate, generating $67K in average monthly revenue.
